# Two Proportion Test in Python

In [2]:
import pandas as pd
import numpy as np
from statsmodels.stats.proportion import proportions_ztest

In [4]:
count = np.array([7, 12])
nobs = np.array([15, 28])
stat, pval = proportions_ztest(count, nobs)
print(stat,pval)

0.23974366706563624 0.810528980523634

# One Proportion Test in Python

In [5]:
count = 15
nobs = 43
value = .5
stat, pval = proportions_ztest(count, nobs, value)
print(stat,pval)

-2.079806538622099 0.03754328113448803

# Goodness of Fit Chi-Squares

In [9]:
import scipy, scipy.stats

In [13]:
SW = pd.read_csv('C:/Users/meredith.dodd/Documents/Data Science/105 Intermediate Statistics/Intermediate Statistics/SW_survey_renamed.csv')

In [14]:
SW.head()

,RespondentID,SeenYN,FanYN,SeenIYN,SeenIIYN,SeenIIIYN,SeenIVYN,SeenVYN,SeenVIYN,RankI,...,Favorable_Yoda,ShotFirst,ExpandedUniverseYN,FanExpandedUniverseYN,StarTrekFanYN,Gender,Age,Household Income,Education,Location
0,3292879998,Yes,Yes,Star Wars: Episode I The Phantom Menace,Star Wars: Episode II Attack of the Clones,Star Wars: Episode III Revenge of the Sith,Star Wars: Episode IV A New Hope,Star Wars: Episode V The Empire Strikes Back,Star Wars: Episode VI Return of the Jedi,3.0,...,Very favorably,I don't understand this question,Yes,No,No,Male,18-29,NaN,High school degree,South Atlantic
1,3292879538,No,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,Yes,Male,18-29,"$0 - $24,999",Bachelor degree,West South Central
2,3292765271,Yes,No,Star Wars: Episode I The Phantom Menace,Star Wars: Episode II Attack of the Clones,Star Wars: Episode III Revenge of the Sith,NaN,NaN,NaN,1.0,...,Unfamiliar (N/A),I don't understand this question,No,NaN,No,Male,18-29,"$0 - $24,999",High school degree,West North Central
3,3292763116,Yes,Yes,Star Wars: Episode I The Phantom Menace,Star Wars: Episode II Attack of the Clones,Star Wars: Episode III Revenge of the Sith,Star Wars: Episode IV A New Hope,Star Wars: Episode V The Empire Strikes Back,Star Wars: Episode VI Return of the Jedi,5.0,...,Very favorably,I don't understand this question,No,NaN,Yes,Male,18-29,"$100,000 - $149,999",Some college or Associate degree,West North Central
4,3292731220,Yes,Yes,Star Wars: Episode I The Phantom Menace,Star Wars: Episode II Attack of the Clones,Star Wars: Episode III Revenge of the Sith,Star Wars: Episode IV A New Hope,Star Wars: Episode V The Empire Strikes Back,Star Wars: Episode VI Return of the Jedi,5.0,...,Somewhat favorably,Greedo,Yes,No,No,Male,18-29,"$100,000 - $149,999",Some college or Associate degree,West North Central

In [17]:
SW.FanYN.value_counts()

Yes    552
No     284
Name: FanYN, dtype: int64

In [11]:
observed_values = scipy.array([552, 284])
expected_values = scipy.array([752, 84])
scipy.stats.chisquare(observed_values, f_exp=expected_values)

Power_divergenceResult(statistic=529.3819655521784, pvalue=3.849512370977756e-117)

# McNemar Chi-Squares

In [3]:
bakery = pd.read_csv('C:/Users/meredith.dodd/Documents/Data Science/105 Intermediate Statistics/Intermediate Statistics/bakery_sales.csv')

In [4]:
bakery.head()

         Date         Time  Transaction           Item
0  10/30/2016   9:58:11 AM            1          Bread
1  10/30/2016  10:05:34 AM            2   Scandinavian
2  10/30/2016  10:05:34 AM            2   Scandinavian
3  10/30/2016  10:07:57 AM            3  Hot chocolate
4  10/30/2016  10:07:57 AM            3            Jam

## Separate the Date Column

In [5]:
bakery1 = bakery['Date'].str.split('/', expand=True).rename(columns = lambda x: "Date" + str(x +1))

In [6]:
bakery1.head()

  Date1 Date2 Date3
0    10    30  2016
1    10    30  2016
2    10    30  2016
3    10    30  2016
4    10    30  2016

In [7]:
bakery3 = pd.concat([bakery, bakery1], axis=1)

In [8]:
bakery3.head()

         Date         Time  Transaction           Item Date1 Date2 Date3
0  10/30/2016   9:58:11 AM            1          Bread    10    30  2016
1  10/30/2016  10:05:34 AM            2   Scandinavian    10    30  2016
2  10/30/2016  10:05:34 AM            2   Scandinavian    10    30  2016
3  10/30/2016  10:07:57 AM            3  Hot chocolate    10    30  2016
4  10/30/2016  10:07:57 AM            3            Jam    10    30  2016

In [9]:
bakery3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21293 entries, 0 to 21292
Data columns (total 7 columns):
Date           21293 non-null object
Time           21293 non-null object
Transaction    21293 non-null int64
Item           21293 non-null object
Date1          21293 non-null object
Date2          21293 non-null object
Date3          21293 non-null object
dtypes: int64(1), object(6)
memory usage: 1.1+ MB

In [11]:
bakery3.Date2 = bakery3.Date2.astype(int)

In [12]:
bakery3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21293 entries, 0 to 21292
Data columns (total 7 columns):
Date           21293 non-null object
Time           21293 non-null object
Transaction    21293 non-null int64
Item           21293 non-null object
Date1          21293 non-null object
Date2          21293 non-null int32
Date3          21293 non-null object
dtypes: int32(1), int64(1), object(5)
memory usage: 1.1+ MB

## Recode the Day

In [13]:
def month (series): 
    if series <= 15: 
        return 0
    if series > 16: 
        return 1
bakery3['DayR'] = bakery3["Date2"].apply(month)

In [14]:
bakery3.head()

,Date,Time,Transaction,Item,Date1,Date2,Date3,DayR
0,10/30/2016,9:58:11 AM,1,Bread,10,30,2016,1.0
1,10/30/2016,10:05:34 AM,2,Scandinavian,10,30,2016,1.0
2,10/30/2016,10:05:34 AM,2,Scandinavian,10,30,2016,1.0
3,10/30/2016,10:07:57 AM,3,Hot chocolate,10,30,2016,1.0
4,10/30/2016,10:07:57 AM,3,Jam,10,30,2016,1.0

## Recode the Item

In [17]:
def item (series): 
    if series == "Coffee": 
        return 1
    if series != "Coffee": 
        return 0
bakery3['CoffeeYN'] = bakery3["Item"].apply(item)

In [18]:
bakery3.head()

,Date,Time,Transaction,Item,Date1,Date2,Date3,DayR,CoffeeYN
0,10/30/2016,9:58:11 AM,1,Bread,10,30,2016,1.0,0
1,10/30/2016,10:05:34 AM,2,Scandinavian,10,30,2016,1.0,0
2,10/30/2016,10:05:34 AM,2,Scandinavian,10,30,2016,1.0,0
3,10/30/2016,10:07:57 AM,3,Hot chocolate,10,30,2016,1.0,0
4,10/30/2016,10:07:57 AM,3,Jam,10,30,2016,1.0,0

## Make a Contingency Table

In [22]:
bakery_crosstab = pd.crosstab(bakery3['DayR'], bakery3['CoffeeYN'])

In [23]:
bakery_crosstab

CoffeeYN     0     1
DayR
0.0       8238  2841
1.0       7126  2491

## Run the Analysis

In [35]:
import statsmodels as sm
from statsmodels.stats.contingency_tables import mcnemar

In [40]:
result = sm.stats.contingency_tables.mcnemar(bakery_crosstab, exact=False, correction=True)

In [42]:
print(result)

pvalue      0.0
statistic   1841.3420286946925